app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index
    @properties = Property.all

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @property = Property.find(params[:id])

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @property = Property.find(params[:id])

INSERT INTO "properties" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 12 Dec 2013 18:01:09 UTC +00:00], ["name", nil], ["updated_at", Thu, 12 Dec 2013 18:01:09 UTC +00:00]]
---
  def create
    @property = Property.new(params[:property])

    respond_to do |format|
      if @property.save

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @property = Property.find(params[:id])

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 1]]
---
  def destroy
    @property = Property.find(params[:id])
    @property.destroy