app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
---
  def index
    @vehicles = Vehicle.all

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @vehicle = Vehicle.find(params[:id])

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @vehicle = Vehicle.find(params[:id])

INSERT INTO "vehicles" ("color", "created_at", "manufacturer", "subtype", "updated_at", "user", "user_id", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @vehicle = current_user.vehicles.build(params[:vehicle])

    #@vehicle = Vehicle.new(params[:vehicle])

    respond_to do |format|
      if @vehicle.save

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "5"]]
---
  def update
    @vehicle = Vehicle.find(params[:id])

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 3]]
---
  def destroy
    @vehicle = Vehicle.find(params[:id])
    @vehicle.destroy